#include <iostream> // команда підключення
#include<math.h> // бібліотека математичних виразів
using namespace std; // застосування простору імен std
int main() 
// тип данних(ціле число, порожній, який програма повертає операційній системі після завершення роботи головна ф-я
{ // початок виконання коду
double x = sqrt(3.) - cbrt(2.); // тип данних для чисел з плаваючою крапкою для обчислення мого невідомого
double rezult = 0; // комірка пам'яті у комп'ютера, куди покроково збирається відповідь за допомогою ф-ї rezult
rezult = pow(x, 4.); // починаємо з чисельника (щоб порахувало x у 4 степені і записало у результат)
double t = sqrt(3.); // ввели через змінну корінь квадратний з 3. (змінна типу дабл з крапкою після числа, щоб рахувало, як дробове
rezult=rezult-(2 * x * t); // віднімаємо від результату добуток
double h = cbrt(4 * x); // у змінній h прописаний кубічний корінь з 4x 
rezult = rezult - h; // віднімаємо h від значення чисельника
rezult -= h+3.; // додаємо число до h, бо воно не під знаком кореня у чисельнику
double g = pow(x,3.); //  обч.знаменника: ввели через змінну вираз під степенем, у дужках спочатку онова, а потім степінь до якого треба піднести її
double r = sqrt(3. * g); // ввели через змінну квадратний корінь з виразу
rezult = rezult / (x - r); // дріб( результат чисельника розділимо на вираз знаменника, що записаний змінними 
cout<< "function(" <<x<<") = "<< rezult<<endl; // виведення результату обчислень на консоль, endl переводить на наступний рядок 
system("pause"); // пауза для того, щоб під час виведення на екран швидко не зникала консоль і ми побачили відповідь





} // кінець роботи коду