#include <iostream> // підключення бібліотеки для введення та виведення даних в консоль
using namespace std; // gпідключення простору імен стд
int main() // головна функція програми, повертає значення
{ // початок виканання коду
double x, y, N; // оголошення змінних дійсного типу для координат точки M
cout << "Enter coordinates M (x, y): "; // виведення на консоль повыдомлення для введення координат 
cin >> x >> y; // введення данних користувачем, зчитування вписаних данних 
N = (y < 0) ? ((y >= x && y <= x + 1) ? 1 : 4) : ((y < x) ? 2 : 3);// Тернарний оператор: повне позбавлення від розгалуджень у блок-схемі
cout << "N = " << N << endl; // виведення підсумкового номера області на екран
	system("pause"); // затримка вікна консолі, щоб результат не зникав миттєво
} // кінець виконання програми