#include<iostream>; // підключення бібліотеки для вводу і виводу
#include<math.h>; // підключення бібліотеки математичних виразів
using namespace std; // використання простору імен std
int main() { // ф-я, яка повертає ціле число операційній системі після завершення роботи коду
	double x, y, z, F = 0; // тип данних для чисел з плаваючою крапкою для створення комірки результату
	cout << "Enter values for x,y,z"; // виведення текствового запиту в консоль для користувача, щоб надати значення для змінних
	cin >> x >> y >> z; // зчитування введених чисел з клавіатури та запис їх у відповідні змінні
	double g = (x < (y - x)) ? x : (y - x); // у зміінну через тернарний оператор записуємо результат мінімуму для чисельника(якшо відповідь на питання чи є цей вираз правдою так, то x і є мінімумом, якщо ж ні, то наступний вираз є правдою
	double k = (y * z) > pow(x,2) ? (y * z) : ((x,2)); // 
	if (abs(k + cos(2 * pow(z, 3))) < 1e-9) {
		cout << "\nError: is zero!";
	}
	else {
		F = g / (k + cos(2 * pow(z, 3)));
		cout << "F = " << F << endl;
	}
	system("pause");
}