#include <iostream> // підключення бібліотеки для введення та виведення даних в консоль
using namespace std; // gпідключення простору імен стд
int main() // головна функція програми, повертає значення
{ // початок виканання коду
double x, y, N; // оголошення змінних дійсного типу для координат точки M
cout << "Enter coordinates M (x, y): ";
cin >> x >> y;
if (y < 0) { // Тернарний оператор: якщо точка між лініями, то область 1, інакше область 4
N = (y >= x && y <= x + 1) ? 1 : 4;
}
// точка знаходиться зверху від осі X(y >= 0) або в інших зонах
else { // Тернарний оператор: якщо точка нижче прямої y=x, то це область 2, інакше область 3
N = (y < x) ? 2 : 3;
}
cout << "N = " << N << endl; // виведення підсумкового номера області на екран
system("pause"); // затримка вікна консолі, щоб результат не зникав миттєво
} // кінець виконання програми