#include<iostream>; // підключення бібліотеки для вводу і виводу
#include<math.h>; // підключення бібліотеки математичних виразів
using namespace std; // використання простору імен std
int main()
{ // ф-я, яка повертає ціле число операційній системі після завершення роботи коду
	double x, y, z, F = 0; // тип данних для чисел з плаваючою крапкою для створення комірки результату
	cout << "Enter values for x,y,z"; // виведення текствового запиту в консоль для користувача, щоб надати значення для змінних
	cin >> x >> y >> z; // зчитування введених чисел з клавіатури та запис їх у відповідні змінні
	double g = (x < (y - x)) ? x : (y - x); // у зміінну через тернарний оператор записуємо результат мінімуму для чисельника(якшо відповідь на питання чи є цей вираз правдою так, то x і є мінімумом, якщо ж ні, то наступний вираз є правдою
	double k = (y * z) > pow(x, 2) ? (y * z) : ((x, 2)); // тернарний оператор: якщо y >= x, то k = x², інакше k дорівнює результату порівняння (y < z)
	if
		(abs(k + cos(2 * pow(z, 3))) < 1e-9) { // перевірка умови: чи дорівнює знаменник нулю (з урахуванням похибки 10^-5) для уникнення ділення на нуль
		cout << "\nError: is zero!"; // виведення повідомлення про помилку ділення на нуль

	} // кінець блоку if
	else { // початок блоку else, якщо ділення на нуль немає і можна проводити розрахунок
		F = g / (k + cos(2 * pow(z, 3))); // обчислення значення виразу та запис результату у змінну P
		cout << "F = " << F << endl; // виведення кінцевого результату P на екран та перехід на новий рядок
	} // кінець блоку else
	system("pause");// затримка вікна консолі, щоб результат не зникав миттєво
}